// lab88.cpp : Этот файл содержит функцию "main". Здесь начинается и заканчивается выполнение программы.
//
#include <cmath>
#include <iostream>
using namespace std; 
int main()
{
	// Упражнение 3(1)
	// 1 ВАРИАНТ ЗАПОЛНЕНИЯ
	cout << "Статический массив, индексная адресация: \n";
	int arr[10];
	for (int i = 0; i <= 9; i++) {
		arr[i] = pow(i, 2);
		cout << "Num(" << i << ") = " << arr[i] << endl;
	}
	// 2 ВАРИАНТ ЗАПОЛНЕНИЯ 
	int arr2[10];
	cout << "-----------------------------------------------------------------\n";
	cout << "Статический массив, адресация с помощью указателя: \n";
	int* ptr = arr2;
	for (int i = 0; i <= 9; i++) {
		*(ptr + i) = i*i;
		cout << "Num(" << i << ") = " << *(ptr+i) << endl;

	}
	// 3 ВАРИАНТ ЗАПОЛНЕНИЯ 
	cout << "-----------------------------------------------------------------\n";
	cout << "Динамический массив, индексная адресация: \n";
	int *arr3 = new int[10];
	for (int i = 0; i <= 9; i++) {
		arr3[i] = i * i;
		cout << "Num(" << i << ") = " << arr3[i] << endl;
	}
	delete[] arr3;
	// 4 ВАРИАНТ ЗАПОЛНЕНИЯ
	cout << "-----------------------------------------------------------------\n";
	cout << "Динамический массив, адресация с помощью указателя: \n";
	int* arr4 = new int[10];
	int* ptr1 = arr4;
	for (int i = 0; i <= 9; i++) {
		*(ptr1 + i) = i * i;
		cout << "Num(" << i << ") = " << *(ptr1+i) << endl;
	}
	delete[] arr4;

}